In [186]:
people={
    "first":["mari","ram","thiruttu"],
    "last":["muthu","kumar","kutti"],
    "email":["muthumariappan002@gmail.com","ram003@gamil.com","thiruttu@gmail.com"]
}

In [187]:
import pandas as pd
df=pd.DataFrame(people)
df

      first   last                        email
0      mari  muthu  muthumariappan002@gmail.com
1       ram  kumar             ram003@gamil.com
2  thiruttu  kutti           thiruttu@gmail.com

In [188]:
#create column full name:
df['first']+ ' ' +df['last']

0        mari muthu
1         ram kumar
2    thiruttu kutti
dtype: object

In [189]:
df['fullname']=df['first']+ ' ' +df['last']
df

      first   last                        email        fullname
0      mari  muthu  muthumariappan002@gmail.com      mari muthu
1       ram  kumar             ram003@gamil.com       ram kumar
2  thiruttu  kutti           thiruttu@gmail.com  thiruttu kutti

In [190]:
df.drop(columns=['last'])

      first                        email        fullname
0      mari  muthumariappan002@gmail.com      mari muthu
1       ram             ram003@gamil.com       ram kumar
2  thiruttu           thiruttu@gmail.com  thiruttu kutti

In [191]:
df['fullname'].str.split(' ',expand=True)

          0      1
0      mari  muthu
1       ram  kumar
2  thiruttu  kutti

In [192]:
df[['first','last']]=df['fullname'].str.split(' ',expand=True)

In [193]:
df

      first   last                        email        fullname
0      mari  muthu  muthumariappan002@gmail.com      mari muthu
1       ram  kumar             ram003@gamil.com       ram kumar
2  thiruttu  kutti           thiruttu@gmail.com  thiruttu kutti

In [194]:
#adding rows
df._append({'first':'tony'},ignore_index=True)

      first   last                        email        fullname
0      mari  muthu  muthumariappan002@gmail.com      mari muthu
1       ram  kumar             ram003@gamil.com       ram kumar
2  thiruttu  kutti           thiruttu@gmail.com  thiruttu kutti
3      tony    NaN                          NaN             NaN

In [195]:
people={
    "first":["khokki","saniya","thiruttu"],
    "last":["kumar","sakada","payan"],
    "email":["khokki002@gmail.com","sakada03@gamil.com","theri@gmail.com"]
}

In [196]:
df2=pd.DataFrame(people)

In [197]:
df2

      first    last                email
0    khokki   kumar  khokki002@gmail.com
1    saniya  sakada   sakada03@gamil.com
2  thiruttu   payan      theri@gmail.com

In [198]:
df=df._append(df2,ignore_index=True)
df

      first    last                        email        fullname
0      mari   muthu  muthumariappan002@gmail.com      mari muthu
1       ram   kumar             ram003@gamil.com       ram kumar
2  thiruttu   kutti           thiruttu@gmail.com  thiruttu kutti
3    khokki   kumar          khokki002@gmail.com             NaN
4    saniya  sakada           sakada03@gamil.com             NaN
5  thiruttu   payan              theri@gmail.com             NaN

In [199]:
df.drop(index=5,inplace=True)

In [202]:
filt=df['last']=='sakada'
df.drop(index=df[filt].index)

      first   last                        email        fullname
0      mari  muthu  muthumariappan002@gmail.com      mari muthu
1       ram  kumar             ram003@gamil.com       ram kumar
2  thiruttu  kutti           thiruttu@gmail.com  thiruttu kutti
3    khokki  kumar          khokki002@gmail.com             NaN